Repository: nickd4/bas-2.5
Catalog: *.po
Languages: de

source: Called
de: Aufruf

source: Proc Called
de: Prozeduraufruf

source: actual parameter
de: Aktualparameter

source: binary operand
de: binären Operanden

source: unary operand
de: monadischen Operanden

source: parenthetic
de: Klammerausdruck

source: program
de: Programm

source: `if' branch
de: `if' Zweig

source: `do' loop
de: `do' Schleife

source: `do while' or `do until' loop
de: `do while' oder `do until' Schleife

source: `else' branch
de: `else' Zweig

source: `for' loop
de: `for' Schleife

source: `while' loop
de: `while' Schleife

source: `repeat' loop
de: `repeat' Schleife

source: `select case' control structure
de: `select case' Steuerstruktur

source: function or procedure
de: Funktion oder Prozedur

source: length
de: Länge

source: rhs
de: rechte Seite

source: Error:
de: Fehler:

source: integer
de: Ganzzahl

source: converted value
de: Konvertierter Wert

source: real
de: Fließkomma

source: bas: Executing `
de: bas: Ausführung von `

source: ' failed (
de: ' nicht möglich (

source: This is free software with ABSOLUTELY NO WARRANTY.
de: Dies ist freie Software ohne JEGLICHE GEWÄHRLEISTUNG.

source: Break
de: Abbruch

source: Use `renum' to number program first
de: Benutzen sie `renum' um das Programm erst zu nummerieren

source: END program
de: END benutzt

source: Invalid line
de: Ungültige Zeile

source: Formal parameter already declared
de: Formaler Parameter bereits deklariert

source: Variable already declared as `local'
de: Variable ist bereits als `local' deklariert

source: Identifier can not be declared as %s
de: Bezeichner kann nicht als %s deklariert werden

source: Ranges must be constructed from single letter identifiers
de: Bereiche müssen durch einbuchstabige Bezeichner gebildet werden

source: Missing line number at the beginning of text line %d
de: Fehlende Zeilennummer zu Beginn der Textzeile %d

source: Invalid unary operand
de: Ungültiger monadischer Operand

source: Invalid binary operand
de: Ungültiger binärer Operand

source: Missing `as'
de: Fehlendes `as'

source: Missing colon `:'
de: Fehlender Doppelpunkt `:'

source: Missing comma `,'
de: Fehlendes Komma `,'

source: Missing right parenthesis `)'
de: Fehlende schließende Klammer `)'

source: Missing `data' input
de: Fehlende `data' Eingabe

source: Missing `dec'/`inc' variable identifier
de: Fehlender `dec'/`inc' Variablenbezeichner

source: Missing equal sign `='
de: Fehlendes Gleichheitszeichen `='

source: Expected %s expression
de: Fehlender Ausdruck für %s

source: Missing `file'
de: Fehlendes `file'

source: Missing `goto' or `gosub'
de: Fehlendes `goto' oder `gosub'

source: Missing variable identifier
de: Fehlender Variablenbezeichner

source: Missing procedure identifier
de: Fehlender Prozedurbezeichner

source: Missing function identifier
de: Fehlender Funktionsbezeichner

source: Missing array variable identifier
de: Fehlender Feldvariablenbezeichner

source: Missing string variable identifier
de: Fehlender Zeichenkettenvariablenbezeichner

source: Missing loop variable identifier
de: Fehlender Schleifenvariablenbezeichner

source: Missing formal parameter identifier
de: Fehlender Formalparameterbezeichner

source: Missing `read' variable identifier
de: Fehlender `read' Variablenbezeichner

source: Missing `swap' variable identifier
de: Fehlender `swap' Variablenbezeichner

source: Missing matrix variable identifier
de: Fehlender Matrixvariablenbezeichner

source: Missing line increment
de: Fehlendes Zeileninkrement

source: Missing `len'
de: Fehlendes `len'

source: Missing line number
de: Fehlende Zeilennummer

source: Missing left parenthesis `('
de: Fehlende öffnende Klammer `('

source: Missing semicolon `;'
de: Fehlender Strichpunkt `;'

source: Missing semicolon `;' or comma `,'
de: Fehlender Strichpunkt `;'

source: Missing star `*'
de: Fehlender Stern `*'

source: Missing statement
de: Fehlende Anweisung

source: Missing `then'
de: Fehlendes `then'

source: Missing `to'
de: Fehlendes `to'

source: Nested definition
de: Verschachtelte Definition

source: No program
de: Kein Programm

source: No such `data' line
de: Es gibt keine solche `data' Zeile

source: No such line
de: Diese Zeile gibt es nicht

source: Redeclaration as different kind of symbol
de: Wiederholte Deklaration mit anderem Symboltyp

source: `case' without `select case'
de: `case' ohne `select case'

source: `do' without `loop'
de: `do' ohne `loop'

source: `do while' or `do until' without `loop'
de: `do while' oder `do until' ohne `loop'

source: `else' without `if'
de: `else' ohne `if'

source: `else' without `end if'
de: `else' ohne `end if'

source: `end if' without multiline `if' or `else'
de: `end if' ohne mehrzeiliges `if' oder `else'

source: `subend', `end sub' or `endproc' without `sub' or `def proc' inside %s
de: `subend', `end sub' oder `endproc' ohne `sub' oder `def proc' innerhalb von %s

source: `subexit' without `sub' inside %s
de: `subexit' ohne `sub' innerhalb %s

source: `end select' without `select case'
de: `end select' ohne `select case'

source: `end function' without `def fn' or `function'
de: `end function' ohne `def fn' oder `function'

source: `=' returning from function without `def fn'
de: `=' beendet Funktion ohne `def fn'

source: `exit do' without `do'
de: `exit do' ohne `do'

source: `exit for' without `for'
de: `exit for' ohne `for'

source: `fnend' without `def fn'
de: `fnend' ohne `def fn'

source: `exit function' outside function declaration
de: `exit function' außerhalb einer Funktionsdeklaration

source: `fnreturn' without `def fn'
de: `fnreturn' ohne `def fn'

source: `for' without `next'
de: `for' ohne `next'

source: Function/procedure declaration without end
de: Funktions-/Prozedurdeklaration ohne Ende

source: `if' without `end if'
de: `if' ohne `end if'

source: `local' without `def fn' or `def proc'
de: `local' ohne `def fn' oder `def proc'

source: `loop' without `do'
de: `loop' ohne `do'

source: `loop until' without `do'
de: `loop until' ohne `do'

source: `next' without `for' inside %s
de: `next' ohne `for' innerhalb %s

source: `repeat' without `until'
de: `repeat' ohne `until'

source: `select case' without `end select'
de: `select case' ohne `end select'

source: `until' without `repeat'
de: `until' ohne `repeat'

source: `wend' without `while' inside %s
de: `wend' ohne `while' innerhalb %s

source: `while' without `wend'
de: `while' ohne `wend'

source: Too few parameters
de: Zu wenige Parameter

source: Too many parameters
de: Zu viele Parameter

source: Type mismatch (has %s, need %s)
de: Typfehler (%s ist angegeben, %s wird benötigt)

source: Type mismatch of argument %d
de: Typfehler bei Argument %d

source: %s of argument %d
de: %s bei Argument %d

source: Type mismatch (need string variable)
de: Typfehler (Zeichenkette-Variable wird benötigt)

source: Type mismatch (need numeric variable)
de: Typfehler (Numerische Variable wird benötigt)

source: Type mismatch (need numeric value)
de: Typfehler (Numerischer Wert wird benötigt)

source: Undeclared function or variable
de: Undeklarierte Funktion oder Variable

source: Line out of scope
de: Zeile außerhalb des gültigen Bereiches

source: Procedures do not return values
de: Prozeduren geben keine Werte zurück

source: Unreachable statement
de: Unerreichbarer Befehl

source: Wrong access mode
de: Falscher Zugriffsmodus

source: `next' variable does not match `for' variable
de: `next' Variable passt nicht zu `for' Variable

source: No such `image' line
de: Es gibt keine solche `image' Zeile

source: Missing `image' format
de: Fehlendes `image' Format

source: Missing relational operator
de: Fehlender Vergleichsoperator

source: Missing `input' data
de: Fehlende Daten für `input'

source: Missing character after underscore `_' in format string
de: In der Format-Zeichenkette fehlt nach dem Unterstrich `_' ein Zeichen

source: Not allowed in interactive mode
de: Im interaktiven Modus nicht erlaubt

source: Not allowed in program mode
de: Im Programm-Modus nicht erlaubt

source: Break
de: Abbruch

source: %s is undefined
de: %s ist nicht definiert

source: %s is out of range
de: %s ist außerhalb des zulässigen Bereiches

source: `resume' without exception
de: `resume' ohne Exception

source: `return' without `gosub'
de: `return' ohne `gosub'

source: Bad %s conversion
de: %s-Konvertierung nicht möglich

source: Input/Output error (%s)
de: Ein-/Ausgabefehler (%s)

source: Input/Output error (Creating `%s' failed: %s)
de: Ein-/Ausgabefehler (Erzeugung von `%s' nicht möglich: %s)

source: Input/Output error (Closing `%s' failed: %s)
de: Ein-/Ausgabefehler (Schließen von `%s' nicht möglich: %s)

source: Input/Output error (Opening `%s' failed: %s)
de: Ein-/Ausgabefehler (Öffnen von `%s' nicht möglich: %s)

source: Setting environment variable failed (%s)
de: Die Umgebungsvariable kann nicht gesetzt werden (%s).

source: Trying to redimension existing array
de: Bereits existierende Fehler können nicht redimensioniert werden.

source: Forking child process failed (%s)
de: Es konnte kein Prozeß erzeugt werden (%s)

source: Invalid mode
de: Ungültiger Modus

source: end of `data'
de: Ende von `data'

source: Dimension mismatch
de: Die Dimensionen stimmen nicht überein

source: Variable dimension must be 2 (is %d), base must be 0 or 1 (is %d)
de: Die Variablendimension muß 2 sein (ist %d) und die Basis muss 0 oder 1 sein (ist %d)

source: Singular matrix
de: Singuläre Matrix

source: Syntax error in print format
de: Syntaktisch fehlerhaftes Druckformat

source: Out of memory
de: Nicht genug Speicher

source: channel #%d not open
de: Kanal #%d nicht offen

source: channel #%d not opened for writing
de: Kanal #%d nicht zum Schreiben geöffnet

source: channel #%d not opened for reading
de: Kanal #%d nicht zum Lesen geöffnet

source: channel #%d not opened for random access
de: Kanal #%d nicht für direkten Zugriff geöffnet

source: channel #%d not opened for binary access
de: Kanal #%d nicht für binären Zugriff geöffnet

source: channel #%d not opened for random or binary access
de: Kanal #%d nicht für direkten oder binären Zugriff geöffnet

source: environment variable TERM is not set
de: Umgebungsvariable TERM ist nicht gesetzt

source: reading terminal description failed
de: Einlesen der Terminalbeschreibung nicht möglich

source: unknown terminal type %s
de: Unbekannter Terminaltyp %s

source: terminal type %s can not clear the screen
de: Terminaltyp %s kann den Bildschirm nicht löschen

source: terminal type %s can not position the cursor
de: Terminaltyp %s kann den Cursor nicht positionieren

source: This installation does not support terminal handling
de: Diese Installation bietet keine Terminalunterstützung

source: channel already open
de: Kanal bereits offen

source: channel not open
de: Kanal #%d nicht offen

source: End of file
de: Dateiende

source: negative width
de: Negative Breite

source: non-positive zone width
de: Nichtpositive Zonenbreite

source: not a terminal
de: ist kein Terminal

source: Direct port access not available
de: Direkter Portzugriff ist nicht möglich

source: Direct memory access not available
de: Direkter Speicherzugriff ist nicht möglich

source: %s: option `%s' is ambiguous
de: %s: Option `%s' ist mehrdeutig.

source: %s: option `--%s' doesn't allow an argument
de: %s: Option `--%s' erlaubt kein Argument.

source: %s: option `%c%s' doesn't allow an argument
de: %s: Option `%c%s' erlaubt kein Argument.

source: %s: option `%s' requires an argument
de: %s: Option `%s' benötigt ein Argument.

source: %s: unrecognized option `--%s'
de: %s: Unbekannte Option `--%s'

source: %s: unrecognized option `%c%s'
de: %s: Unbekannte Option `%c%s'

source: %s: illegal option -- %c
de: %s: Ungültige Option -- %c

source: %s: invalid option -- %c
de: %s: Ungültige Option -- %c

source: %s: option requires an argument -- %c
de: %s: Option benötigt ein Argument -- %c

source: %s: option `-W %s' is ambiguous
de: %s: Option `-W %s' ist mehrdeutig

source: %s: option `-W %s' doesn't allow an argument
de: %s: Option `-W %s' erlaubt kein Argument

source: variable number
de: Variablennummer

source: `asc' or `code' of empty string
de: `asc' oder `code' von leerer Zeichenkette

source: number
de: Zahl

source: digits
de: Ziffern

source: character code
de: Zeichencode

source: argument number
de: Argumentnummer

source: time
de: Zeit

source: channel
de: Kanal

source: Logarithm of negative value
de: Logarithmus von negativem Wert

source: limit
de: Grenze

source: Square root argument
de: Argument der Quadratwurzel

source: `string$' of empty string
de: `string$' von leerer Zeichenkette

source: Try `bas -h' or `bas --help' for more information.
de: Versuchen Sie `bas -h' oder `bas --help' für weitere Informationen.

source: Usage: bas [-b] [-l file] [-u] [program [argument ...]]
de: Aufruf: bas [-b] [-l Datei] [-u] [Programm [Argument ...]]

source: -b, --backslash-colon convert backslashs to colons
de: -b, --backslash-colon Konvertiert linksseitige Schrägstriche in Doppelpunkte

source: -l, --lp write LPRINT output to file
de: -l, --lp Schreibt LPRINT Ausgaben in die Datei

source: -u, --uppercase output all tokens in uppercase
de: -u, --uppercase Alle Tokens in Großbuchstaben ausgeben

source: -h, --help display this help and exit
de: -h, --help Diese Hilfe anzeigen und beenden

source: --version output version information and exit
de: --version Versionsinformation ausgeben und beenden

source: Report bugs to <michael@moria.de>.
de: Teilen Sie Fehler <michael@moria.de> mit.

source: bas: Opening `%s' for line printer output failed (%s).
de: bas: Die Datei `%s' kann nicht für Druckausgaben geöffnet werden (%s).

source: in line %ld at:
de: in Zeile %ld:

source: at: end of program
de: : Ende des Programms

source: end of line
de: Zeilenende

source: Function Referenced in line
de: Funktion Referenziert in Zeile

source: Variable Referenced in line
de: Variable Referenziert in Zeile

source: Gosub Referenced in line
de: Gosub Referenziert in Zeile

source: Goto Referenced in line
de: Goto Referenziert in Zeile

source: directory
de: Verzeichnis

source: foreground colour
de: Vordergrundfarbe

source: background colour
de: Hintergrundfarbe

source: border colour
de: Rahmenfarbe

source: string
de: Zeichenkette

source: file name
de: Dateiname

source: generating temporary file name failed
de: Erzeugung eines temporären Dateinamens nicht möglich

source: environment variable
de: Umgebungsvariable

source: return
de: Funktionswert

source: field width
de: Feldbreite

source: implicit STEP 1:
de: Impliziter Schritt 1:

source: record number
de: Datensatznummer

source: `put'/`get' data
de: `put'/`get' Daten

source: end of file
de: Dateiende

source: row
de: Zeile

source: column
de: Spalte

source: condition
de: Bedingung

source: Too much input data
de: Zu viele Eingabedaten

source: factor
de: Faktor

source: format string
de: Formatzeichenkette

source: step
de: Schrittweite

source: selector
de: Auswahl

source: mode or file
de: Modus oder Datei

source: record length
de: Satzlänge

source: array subscript base
de: Feldindexbasis

source: address
de: Adresse

source: output value
de: Ausgabewert

source: count
de: Anzahl

source: random number generator seed
de: Zufallszahlengenerator Start

source: source file
de: Quelldatei

source: destination file
de: Zieldatei

source: Quit without saving? (y/n)
de: Beenden ohne zu speichern? (j/n)

source: yes
de: ja

source: mask
de: Maske

source: select
de: Auswahl

source: zone width
de: Zonenbreite

source: void
de: leer

source: unpaired \ in format
de: Unpaariges \ im Format

source: array index
de: Feldindex
